using System.Collections;
using System.Collections.Generic;
using UnityEngine;


/// <summary>
/// 谜题数据
/// </summary>
public static class RiddleData 
{
    public static string story1 = "公元1961年，人类太空技术取得重大突破。人类文明从此进入太空时代，开始向宇宙深处探寻。";
    public static string story2 = "公元2050年，人类联邦建造出第一艘超光速飞船。同期，人类联邦通过“可接触星系文明预防管控”法案，" +
        "为应对未知危机，将一切可接触星系文明视为潜在敌人，全球由此进入军事竞备状态。";
    public static string story3 = "公元3550年，人类联邦开启对外征服战争，所毁灭的星系文明不计其数。经过数千年的战争，人类文明取得了最终胜利，" +
        "占领星系上万亿，更是奴役了不计其数的附属文明，最终与其他宇宙顶尖文明势力取得平衡，达成和平协议。";
    public static string story4 = "公元10492年，人类联邦所属辖区超时空传送通道受袭，对外防卫战争突然爆发。因为一个秘密，宇宙其他顶尖势力同时进攻人类联邦。" +
        "面对此次危机，人类却选择死守秘密，坚持抗争到底。";
    public static string story5 = "公元11111年，人类联邦再也无法抵抗外部进攻。在最后时刻，人类联邦突然引爆了所属辖区的所有恒星，并且利用未知科技将爆炸扩散到了全宇宙，" +
        "九成九的星系文明势力在这次袭击下彻底消失，只剩余人类文明和几个残留势力。";
    public static string story6 = "秘密最终被解开，人类文明的引领者之一华夏文明曾经突破源宇宙观测技术，偶然发现一个全新的源宇宙，并且成功找到连接通道。人类联邦在秘密潜入新宇宙后，" +
        "发现了无法估量的资源，以此为基业，人类文明成为宇宙霸主指日可待。";
    public static string story7 = "人类文明最终还是成功守护了这个秘密。\r\n然而当前宇宙却因为恒星大爆炸而发生空间坍缩，无数空间开始破碎然后消失。在连续坍缩之后，" +
        "宇宙空间剩余大小不足之前万分之一。\r\n大坍缩吞噬无数矿产资源，人类文明主力已提前撤离至新宇宙，然而地球却被当做诱饵抛弃，此时地球上还有上百亿的的人口存留......";
    public static string story8 = "生命的力量在于不屈，地球剩余人口全票通过“行星逃逸”计划，利用地球遗留资源勉强建造了数座行星发动机，开始缓慢向源宇宙通道连接处前进。";
    public static string story9 = "你已被破格提拔为少将，将驾驶仅存的太空飞船为地球领航。你将遭受宇宙残留势力的疯狂报复，同时承担收集航行资源的重任。\r\n宇宙仍然在不断坍缩，" +
        "在此绝境下，地球的未来掌握在了你的手中...";
}
